---
kind: property
id: P:Autodesk.Revit.UI.TabbedDialogExtension.OnOKAction
source: html/9d7af24c-22f2-f301-ed6e-c912b39916ef.htm
---
# Autodesk.Revit.UI.TabbedDialogExtension.OnOKAction Property

The ok handler.

## Syntax (C#)
```csharp
public TabbedDialogAction OnOKAction { get; }
```

## Remarks
This handler will be invoked when the "Ok" button in Revit options dialog is clicked.